// 정수 간의 가감승제를 계산하는 프로그램 

#include <stdio.h>

pragma

void main() 
{
	x							// 첫 번째 정수를 저장할 변수 
	y							// 두 번째 정수를 저장할 변수 
			// 두 정수 간의 연산의 결과를 저장하는 변수
	x = 							// 변수 x에 2을 저장	
	y = 							// 변수 y에 10을 저장
	sum = 					// 변수 sum에 (x+y)의 결과를 저장
	diff = 					// 변수 diff에 (x-y)의 결과를 저장
	mul = 					// 변수 mul에 (x*y)의 결과를 저장
	div = 					// 변수 div에 (x/y)의 결과를 저장
	"두수의 합: %d\n"	// 변수 sum의 값을 화면에 출력
	"두수의 차: %d\n"	// 변수 diff의 값을 화면에 출력
	"두수의 곱: %d\n"	// 변수 mul의 값을 화면에 출력
	"두수의 몫: %d\n"	// 변수 div의 값을 화면에 출력
}